<hr><hr>

# Introdução à manipulação de dados com o Pandas (Parte I)

In [4]:
import pandas as pd
import numpy as np

In [2]:
num_array = range(50,70,2)
list(num_array)

[50, 52, 54, 56, 58, 60, 62, 64, 66, 68]

In [5]:
serie = pd.Series(num_array)
serie

0    50
1    52
2    54
3    56
4    58
5    60
6    62
7    64
8    66
9    68
dtype: int64

In [6]:
serie.index

RangeIndex(start=0, stop=10, step=1)

In [7]:
serie.values

array([50, 52, 54, 56, 58, 60, 62, 64, 66, 68], dtype=int64)

In [10]:
serie2 = pd.Series([1,5,7], 
                   index=['a','b','c'])
serie2

a    1
b    5
c    7
dtype: int64

# DataFrames

In [12]:
modelos = ['A4 3.0 Quattro 4dr manual',
 'A4 3.0 Quattro 4dr auto',
 'A6 3.0 4dr',
 'A6 3.0 Quattro 4dr',
 'A4 3.0 convertible 2dr']
peso = [3583, 3627, 3561, 3880, 3814]
precos = ['$33,430', '$34,480', '$36,640', '$39,640', '$42,490']

In [13]:
serie_pesos = pd.Series(peso, index = modelos)
serie_pesos

A4 3.0 Quattro 4dr manual    3583
A4 3.0 Quattro 4dr auto      3627
A6 3.0 4dr                   3561
A6 3.0 Quattro 4dr           3880
A4 3.0 convertible 2dr       3814
dtype: int64

In [14]:
serie_precos = pd.Series(precos, index = modelos)
serie_precos

A4 3.0 Quattro 4dr manual    $33,430
A4 3.0 Quattro 4dr auto      $34,480
A6 3.0 4dr                   $36,640
A6 3.0 Quattro 4dr           $39,640
A4 3.0 convertible 2dr       $42,490
dtype: object

In [17]:
df = pd.DataFrame({'Pesos':serie_pesos,'Precos':serie_precos})
df

                           Pesos   Precos
A4 3.0 Quattro 4dr manual   3583  $33,430
A4 3.0 Quattro 4dr auto     3627  $34,480
A6 3.0 4dr                  3561  $36,640
A6 3.0 Quattro 4dr          3880  $39,640
A4 3.0 convertible 2dr      3814  $42,490

In [18]:
df.loc['A6 3.0 4dr']

Pesos        3561
Precos    $36,640
Name: A6 3.0 4dr, dtype: object

In [19]:
df.loc[df.Pesos>=3600,'Precos']

A4 3.0 Quattro 4dr auto    $34,480
A6 3.0 Quattro 4dr         $39,640
A4 3.0 convertible 2dr     $42,490
Name: Precos, dtype: object

# Operações

In [20]:
df

                           Pesos   Precos
A4 3.0 Quattro 4dr manual   3583  $33,430
A4 3.0 Quattro 4dr auto     3627  $34,480
A6 3.0 4dr                  3561  $36,640
A6 3.0 Quattro 4dr          3880  $39,640
A4 3.0 convertible 2dr      3814  $42,490

In [21]:
comp = [179, 180, 181, 192, 180]
df = pd.DataFrame({'Pesos':serie_pesos,
                   'Comprimento':comp})
df

                           Pesos  Comprimento
A4 3.0 Quattro 4dr manual   3583          179
A4 3.0 Quattro 4dr auto     3627          180
A6 3.0 4dr                  3561          181
A6 3.0 Quattro 4dr          3880          192
A4 3.0 convertible 2dr      3814          180

In [23]:
df.iloc[1]

Pesos          3627
Comprimento     180
Name: A4 3.0 Quattro 4dr auto, dtype: int64

In [24]:
df / df.iloc[0]*100

                                Pesos  Comprimento
A4 3.0 Quattro 4dr manual  100.000000   100.000000
A4 3.0 Quattro 4dr auto    101.228021   100.558659
A6 3.0 4dr                  99.385989   101.117318
A6 3.0 Quattro 4dr         108.289143   107.262570
A4 3.0 convertible 2dr     106.447111   100.558659

In [41]:
df

                           Pesos  Comprimento
A4 3.0 Quattro 4dr manual   3583          179
A4 3.0 Quattro 4dr auto     3627          180
A6 3.0 4dr                  3561          181
A6 3.0 Quattro 4dr          3880          192
A4 3.0 convertible 2dr      3814          180

In [43]:
df['Pesos']

A4 3.0 Quattro 4dr manual    3583
A4 3.0 Quattro 4dr auto      3627
A6 3.0 4dr                   3561
A6 3.0 Quattro 4dr           3880
A4 3.0 convertible 2dr       3814
Name: Pesos, dtype: int64

In [45]:
df[['Pesos']]

                           Pesos
A4 3.0 Quattro 4dr manual   3583
A4 3.0 Quattro 4dr auto     3627
A6 3.0 4dr                  3561
A6 3.0 Quattro 4dr          3880
A4 3.0 convertible 2dr      3814

In [42]:
df.T

,A4 3.0 Quattro 4dr manual,A4 3.0 Quattro 4dr auto,A6 3.0 4dr,A6 3.0 Quattro 4dr,A4 3.0 convertible 2dr
Pesos,3583,3627,3561,3880,3814
Comprimento,179,180,181,192,180

In [26]:
numeros_texto = ['primeiro','segundo','terceiro','quarto',
'quinto','sexto','sétimo','oitavo','nono','décimo']

Numeros_2 = range(50,70,2)
Numeros_serie_2 = pd.Series(Numeros_2,numeros_texto)

Numeros_3 = range(51,70,2)
Numeros_serie_3 = pd.Series(Numeros_3,numeros_texto)

In [27]:
Numeros_serie_2

primeiro    50
segundo     52
terceiro    54
quarto      56
quinto      58
sexto       60
sétimo      62
oitavo      64
nono        66
décimo      68
dtype: int64

In [28]:
Numeros_serie_3

primeiro    51
segundo     53
terceiro    55
quarto      57
quinto      59
sexto       61
sétimo      63
oitavo      65
nono        67
décimo      69
dtype: int64

In [29]:
Numeros_serie_2+Numeros_serie_3

primeiro    101
segundo     105
terceiro    109
quarto      113
quinto      117
sexto       121
sétimo      125
oitavo      129
nono        133
décimo      137
dtype: int64

In [30]:
Numeros_serie_2_porcao = Numeros_serie_2[4:7]
Numeros_serie_2_porcao

quinto    58
sexto     60
sétimo    62
dtype: int64

In [32]:
Numeros_serie_3_porcao = Numeros_serie_3[5:8]
Numeros_serie_3_porcao

sexto     61
sétimo    63
oitavo    65
dtype: int64

In [33]:
Numeros_serie_2_porcao+Numeros_serie_3_porcao

oitavo      NaN
quinto      NaN
sexto     121.0
sétimo    125.0
dtype: float64

In [34]:
Numeros_serie_2_porcao.add(Numeros_serie_3_porcao, fill_value = 0)

oitavo     65.0
quinto     58.0
sexto     121.0
sétimo    125.0
dtype: float64

In [35]:
serie_soma = Numeros_serie_2_porcao+Numeros_serie_3_porcao
serie_soma

oitavo      NaN
quinto      NaN
sexto     121.0
sétimo    125.0
dtype: float64

In [36]:
serie_soma.isnull()

oitavo     True
quinto     True
sexto     False
sétimo    False
dtype: bool

In [37]:
serie_soma.fillna(0)

oitavo      0.0
quinto      0.0
sexto     121.0
sétimo    125.0
dtype: float64

In [38]:
serie_soma.dropna()

sexto     121.0
sétimo    125.0
dtype: float64

In [39]:
dfa = pd.read_csv('../../bases/aula06.csv')
#pd.read_excel()
dfa

   col0  col1  col2 col3 col4 col5 col6
0     1   9.0   1.0    3    C
1     2   8.0   NaN    4    A    A    A
2     5   7.0   1.0    4    A    A
3     9   7.0   2.0    3    A    A    A
4     8   8.0   2.0    4    B    B
5     4   7.0   1.0         C    C    C
6     9   NaN  99.0    4    C    C    C
7     4   NaN   NaN    4    B
8     2   NaN   NaN         B

In [40]:
dfa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col0    9 non-null      int64
 1   col1    6 non-null      float64
 2   col2    6 non-null      float64
 3   col3    9 non-null      object
 4   col4    9 non-null      object
 5   col5    9 non-null      object
 6   col6    9 non-null      object
dtypes: float64(2), int64(1), object(4)
memory usage: 632.0+ bytes

In [46]:
dfa.isnull()

    col0   col1   col2   col3   col4   col5   col6
0  False  False  False  False  False  False  False
1  False  False   True  False  False  False  False
2  False  False  False  False  False  False  False
3  False  False  False  False  False  False  False
4  False  False  False  False  False  False  False
5  False  False  False  False  False  False  False
6  False   True  False  False  False  False  False
7  False   True   True  False  False  False  False
8  False   True   True  False  False  False  False

In [50]:
dfa.fillna(0)

   col0  col1  col2 col3 col4 col5 col6
0     1   9.0   1.0    3    C
1     2   8.0   0.0    4    A    A    A
2     5   7.0   1.0    4    A    A
3     9   7.0   2.0    3    A    A    A
4     8   8.0   2.0    4    B    B
5     4   7.0   1.0         C    C    C
6     9   0.0  99.0    4    C    C    C
7     4   0.0   0.0    4    B
8     2   0.0   0.0         B

In [55]:
dfa.dropna()

   col0  col1  col2 col3 col4 col5 col6
0     1   9.0   1.0    3    C
2     5   7.0   1.0    4    A    A
3     9   7.0   2.0    3    A    A    A
4     8   8.0   2.0    4    B    B
5     4   7.0   1.0         C    C    C

In [53]:
dfa.dropna(subset = ['col2'])

   col0  col1  col2 col3 col4 col5 col6
0     1   9.0   1.0    3    C
2     5   7.0   1.0    4    A    A
3     9   7.0   2.0    3    A    A    A
4     8   8.0   2.0    4    B    B
5     4   7.0   1.0         C    C    C

In [52]:
dfa

   col0  col1  col2 col3 col4 col5 col6
0     1   9.0   1.0    3    C
1     2   8.0   NaN    4    A    A    A
2     5   7.0   1.0    4    A    A
3     9   7.0   2.0    3    A    A    A
4     8   8.0   2.0    4    B    B
5     4   7.0   1.0         C    C    C
6     9   NaN  99.0    4    C    C    C
7     4   NaN   NaN    4    B
8     2   NaN   NaN         B

In [56]:
dfa = pd.read_csv('../../bases/aula06.csv')
dfa

   col0  col1  col2 col3 col4 col5 col6
0     1   9.0   1.0    3    C
1     2   8.0   NaN    4    A    A    A
2     5   7.0   1.0    4    A    A
3     9   7.0   2.0    3    A    A    A
4     8   8.0   2.0    4    B    B
5     4   7.0   1.0         C    C    C
6     9   NaN  99.0    4    C    C    C
7     4   NaN   NaN    4    B
8     2   NaN   NaN         B

In [57]:
dfa['col3'] = dfa['col3'].replace([""," "],np.nan)
dfa['col3'] = dfa['col3'].astype(float)
dfa

   col0  col1  col2  col3 col4 col5 col6
0     1   9.0   1.0   3.0    C
1     2   8.0   NaN   4.0    A    A    A
2     5   7.0   1.0   4.0    A    A
3     9   7.0   2.0   3.0    A    A    A
4     8   8.0   2.0   4.0    B    B
5     4   7.0   1.0   NaN    C    C    C
6     9   NaN  99.0   4.0    C    C    C
7     4   NaN   NaN   4.0    B
8     2   NaN   NaN   NaN    B

In [58]:
dfa['col5'] = dfa['col5'].replace([""," "],"missing")
dfa['col6'] = dfa['col6'].replace([""," "],"missing")
dfa

   col0  col1  col2  col3 col4     col5     col6
0     1   9.0   1.0   3.0    C  missing  missing
1     2   8.0   NaN   4.0    A        A        A
2     5   7.0   1.0   4.0    A        A  missing
3     9   7.0   2.0   3.0    A        A        A
4     8   8.0   2.0   4.0    B        B  missing
5     4   7.0   1.0   NaN    C        C        C
6     9   NaN  99.0   4.0    C        C        C
7     4   NaN   NaN   4.0    B  missing  missing
8     2   NaN   NaN   NaN    B  missing  missing

In [59]:
dfa['col1'] = dfa['col1'].fillna(0)
dfa

   col0  col1  col2  col3 col4     col5     col6
0     1   9.0   1.0   3.0    C  missing  missing
1     2   8.0   NaN   4.0    A        A        A
2     5   7.0   1.0   4.0    A        A  missing
3     9   7.0   2.0   3.0    A        A        A
4     8   8.0   2.0   4.0    B        B  missing
5     4   7.0   1.0   NaN    C        C        C
6     9   0.0  99.0   4.0    C        C        C
7     4   0.0   NaN   4.0    B  missing  missing
8     2   0.0   NaN   NaN    B  missing  missing

In [60]:
np.nanmean(dfa['col2'])

17.666666666666668

In [64]:
dfa['col2'] = dfa['col2'].fillna(np.nanmean(dfa['col2']))
dfa

   col0  col1       col2  col3 col4     col5     col6
0     1   9.0   1.000000   3.0    C  missing  missing
1     2   8.0  17.666667   4.0    A        A        A
2     5   7.0   1.000000   4.0    A        A  missing
3     9   7.0   2.000000   3.0    A        A        A
4     8   8.0   2.000000   4.0    B        B  missing
5     4   7.0   1.000000   NaN    C        C        C
6     9   0.0  99.000000   4.0    C        C        C
7     4   0.0  17.666667   4.0    B  missing  missing
8     2   0.0  17.666667   NaN    B  missing  missing

In [65]:
dfa['col3'] = dfa['col3'].fillna(np.nanmedian(dfa['col3']))
dfa

   col0  col1       col2  col3 col4     col5     col6
0     1   9.0   1.000000   3.0    C  missing  missing
1     2   8.0  17.666667   4.0    A        A        A
2     5   7.0   1.000000   4.0    A        A  missing
3     9   7.0   2.000000   3.0    A        A        A
4     8   8.0   2.000000   4.0    B        B  missing
5     4   7.0   1.000000   4.0    C        C        C
6     9   0.0  99.000000   4.0    C        C        C
7     4   0.0  17.666667   4.0    B  missing  missing
8     2   0.0  17.666667   4.0    B  missing  missing

In [66]:
dfa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col0    9 non-null      int64
 1   col1    9 non-null      float64
 2   col2    9 non-null      float64
 3   col3    9 non-null      float64
 4   col4    9 non-null      object
 5   col5    9 non-null      object
 6   col6    9 non-null      object
dtypes: float64(3), int64(1), object(3)
memory usage: 632.0+ bytes

In [67]:
dfa

   col0  col1       col2  col3 col4     col5     col6
0     1   9.0   1.000000   3.0    C  missing  missing
1     2   8.0  17.666667   4.0    A        A        A
2     5   7.0   1.000000   4.0    A        A  missing
3     9   7.0   2.000000   3.0    A        A        A
4     8   8.0   2.000000   4.0    B        B  missing
5     4   7.0   1.000000   4.0    C        C        C
6     9   0.0  99.000000   4.0    C        C        C
7     4   0.0  17.666667   4.0    B  missing  missing
8     2   0.0  17.666667   4.0    B  missing  missing

In [68]:
dfa.describe()

           col0      col1       col2      col3
count  9.000000  9.000000   9.000000  9.000000
mean   4.888889  5.111111  17.666667  3.777778
std    3.100179  3.887301  31.502645  0.440959
min    1.000000  0.000000   1.000000  3.000000
25%    2.000000  0.000000   1.000000  4.000000
50%    4.000000  7.000000   2.000000  4.000000
75%    8.000000  8.000000  17.666667  4.000000
max    9.000000  9.000000  99.000000  4.000000